In [25]:
import pandas as pd 
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [26]:
data=r"C:\Users\janvi soni\Desktop\datasets\Groceries data.csv"
names=['Member_number','Date','itemDescription','year','month','day','day_of_week']

In [27]:

df=pd.read_csv(data)
df

,Member_number,Date,itemDescription,year,month,day,day_of_week
0,1808,2015-07-21,tropical fruit,2015,7,21,1
1,2552,2015-05-01,whole milk,2015,5,1,4
2,2300,2015-09-19,pip fruit,2015,9,19,5
3,1187,2015-12-12,other vegetables,2015,12,12,5
4,3037,2015-01-02,whole milk,2015,1,2,4
...,...,...,...,...,...,...,...
38760,4471,2014-08-10,sliced cheese,2014,8,10,6
38761,2022,2014-02-23,candy,2014,2,23,6
38762,1097,2014-04-16,cake bar,2014,4,16,2
38763,1510,2014-03-12,fruit/vegetable juice,2014,3,12,2
38764,1521,2014-12-26,cat food,2014,12,26,4

In [28]:
df=pd.read_csv(data,names=names)
df

,Member_number,Date,itemDescription,year,month,day,day_of_week
0,Member_number,Date,itemDescription,year,month,day,day_of_week
1,1808,2015-07-21,tropical fruit,2015,7,21,1
2,2552,2015-05-01,whole milk,2015,5,1,4
3,2300,2015-09-19,pip fruit,2015,9,19,5
4,1187,2015-12-12,other vegetables,2015,12,12,5
...,...,...,...,...,...,...,...
38761,4471,2014-08-10,sliced cheese,2014,8,10,6
38762,2022,2014-02-23,candy,2014,2,23,6
38763,1097,2014-04-16,cake bar,2014,4,16,2
38764,1510,2014-03-12,fruit/vegetable juice,2014,3,12,2
38765,1521,2014-12-26,cat food,2014,12,26,4

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38766 entries, 0 to 38765
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Member_number    38766 non-null  object
 1   Date             38766 non-null  object
 2   itemDescription  38766 non-null  object
 3   year             38766 non-null  object
 4   month            38766 non-null  object
 5   day              38766 non-null  object
 6   day_of_week      38766 non-null  object
dtypes: object(7)
memory usage: 2.1+ MB

In [19]:
df['itemDescription']

0               tropical fruit
1                   whole milk
2                    pip fruit
3             other vegetables
4                   whole milk
                 ...
38760            sliced cheese
38761                    candy
38762                 cake bar
38763    fruit/vegetable juice
38764                 cat food
Name: itemDescription, Length: 38765, dtype: object

In [20]:
df['itemDescription'].describe()

count          38765
unique           167
top       whole milk
freq            2502
Name: itemDescription, dtype: object

In [21]:
df.describe()

       Member_number          year         month           day   day_of_week
count   38765.000000  38765.000000  38765.000000  38765.000000  38765.000000
mean     3003.641868   2014.528518      6.477570     15.753231      3.014498
std      1153.611031      0.499193      3.431561      8.801391      1.987669
min      1000.000000   2014.000000      1.000000      1.000000      0.000000
25%      2002.000000   2014.000000      4.000000      8.000000      1.000000
50%      3005.000000   2015.000000      6.000000     16.000000      3.000000
75%      4007.000000   2015.000000      9.000000     23.000000      5.000000
max      5000.000000   2015.000000     12.000000     31.000000      6.000000

In [22]:
df.describe(include='object')

              Date itemDescription
count        38765           38765
unique         728             167
top     2015-01-21      whole milk
freq            96            2502

In [23]:
df.isnull().sum()

Member_number      0
Date               0
itemDescription    0
year               0
month              0
day                0
day_of_week        0
dtype: int64

In [29]:
df.head()

   Member_number        Date   itemDescription  year  month  day  day_of_week
0  Member_number        Date   itemDescription  year  month  day  day_of_week
1           1808  2015-07-21    tropical fruit  2015      7   21            1
2           2552  2015-05-01        whole milk  2015      5    1            4
3           2300  2015-09-19         pip fruit  2015      9   19            5
4           1187  2015-12-12  other vegetables  2015     12   12            5

In [30]:
df.head(30)

,Member_number,Date,itemDescription,year,month,day,day_of_week
0,Member_number,Date,itemDescription,year,month,day,day_of_week
1,1808,2015-07-21,tropical fruit,2015,7,21,1
2,2552,2015-05-01,whole milk,2015,5,1,4
3,2300,2015-09-19,pip fruit,2015,9,19,5
4,1187,2015-12-12,other vegetables,2015,12,12,5
5,3037,2015-01-02,whole milk,2015,1,2,4
6,4941,2015-02-14,rolls/buns,2015,2,14,5
7,4501,2015-08-05,other vegetables,2015,8,5,2
8,3803,2015-12-23,pot plants,2015,12,23,2
9,2762,2015-03-20,whole milk,2015,3,20,4
10,4119,2015-12-02,tropical fruit,2015,12,2,2
11,1340,2015-02-24,citrus fruit,2015,2,24,1
12,2193,2015-04-14,beef,2015,4,14,1
13,1997,2015-07-21,frankfurter,2015,7,21,1
14,4546,2015-03-09,chicken,2015,3,9,0
15,4736,2015-07-21,butter,2015,7,21,1
16,1959,2015-03-30,fruit/vegetable juice,2015,3,30,0
17,1974,2015-03-05,packaged fruit/vegetables,2015,3,5,3
18,2421,2015-02-09,chocolate,2015,2,9,0
19,1513,2015-03-08,specialty bar,2015,3,8,6
20,1905,2015-07-07,other vegetables,2015,7,7,1
21,2810,2015-08-09,butter milk,2015,8,9,6
22,2867,2015-12-11,whole milk,2015,12,11,4
23,3962,2015-09-18,tropical fruit,2015,9,18,4
24,1088,2015-11-30,tropical fruit,2015,11,30,0
25,4976,2015-07-17,bottled water,2015,7,17,4
26,4056,2015-12-06,yogurt,2015,12,6,6
27,3611,2015-02-13,sausage,2015,2,13,4
28,1420,2015-01-14,other vegetables,2015,1,14,2
29,4286,2015-08-03,brown bread,2015,8,3,0

In [34]:
df.drop(['day_of_week'],axis=1)

       Member_number        Date        itemDescription  year  month  day
0      Member_number        Date        itemDescription  year  month  day
1               1808  2015-07-21         tropical fruit  2015      7   21
2               2552  2015-05-01             whole milk  2015      5    1
3               2300  2015-09-19              pip fruit  2015      9   19
4               1187  2015-12-12       other vegetables  2015     12   12
...              ...         ...                    ...   ...    ...  ...
38761           4471  2014-08-10          sliced cheese  2014      8   10
38762           2022  2014-02-23                  candy  2014      2   23
38763           1097  2014-04-16               cake bar  2014      4   16
38764           1510  2014-03-12  fruit/vegetable juice  2014      3   12
38765           1521  2014-12-26               cat food  2014     12   26

[38766 rows x 6 columns]